load-testing/results/after-index-1thread-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 38.099999999999994,
    "medianResTime" : 22.0,
    "minResTime" : 20.0,
    "maxResTime" : 102.0,
    "pct1ResTime" : 97.20000000000002,
    "pct2ResTime" : 102.0,
    "pct3ResTime" : 102.0,
    "throughput" : 25.906735751295336,
    "receivedKBytesPerSec" : 173.7066871761658,
    "sentKBytesPerSec" : 4.806913860103627
  },
  "Search Users" : {
    "transaction" : "Search Users",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 38.099999999999994,
    "medianResTime" : 22.0,
    "minResTime" : 20.0,
    "maxResTime" : 102.0,
    "pct1ResTime" : 97.20000000000002,
    "pct2ResTime" : 102.0,
    "pct3ResTime" : 102.0,
    "throughput" : 25.906735751295336,
    "receivedKBytesPerSec" : 173.7066871761658,
    "sentKBytesPerSec" : 4.806913860103627
  }
}