load-testing/results/before-index-100threads-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4490.596000000002,
    "medianResTime" : 4460.0,
    "minResTime" : 405.0,
    "maxResTime" : 9506.0,
    "pct1ResTime" : 6387.5,
    "pct2ResTime" : 7294.9,
    "pct3ResTime" : 8194.48,
    "throughput" : 20.085967942795165,
    "receivedKBytesPerSec" : 107.65780666251557,
    "sentKBytesPerSec" : 3.641601680191218
  },
  "Search Users" : {
    "transaction" : "Search Users",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4490.596000000002,
    "medianResTime" : 4460.0,
    "minResTime" : 405.0,
    "maxResTime" : 9506.0,
    "pct1ResTime" : 6387.5,
    "pct2ResTime" : 7294.9,
    "pct3ResTime" : 8194.48,
    "throughput" : 20.085967942795165,
    "receivedKBytesPerSec" : 107.65780666251557,
    "sentKBytesPerSec" : 3.641601680191218
  }
}